Revit 2027 API
FilledRegionType.LineWeight Property
 The line weight of the fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LineWeight { get; set; }
Public Property LineWeight As Integer
	Get
	Set
public:
property int LineWeight {
	int get ();
	void set (int value);
}
member LineWeight : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: lineWeight is not a valid line weight value (it must be within the range of 1-16).
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace